Tekla Open API Reference for Tekla Structures 2025
Part.Attributes Property
 The attributes of the part. For more information see Part.PartAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part.PartAttributes Attributes { get; set; }
Public Property Attributes As Part.PartAttributes
	Get
	Set
Property Value
Type: Part.PartAttributes
See Also
Reference
Part Class
Tekla.Structures.Drawing Namespace